app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jineet"], ["title", "Starting"], ["content", "Just starting with rails on ruby"], ["created_at", "2019-05-28 08:35:34.248783"], ["updated_at", "2019-05-28 08:35:34.248783"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save